src/cf/Catalogs/ТЦПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТЦПользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦТипАутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОригинальногоПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТЦПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разделители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТЦТипАутентификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТЦТипАутентификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аутентификация1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АутентификацияОС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ТЦПользователи/Forms/Пользователь/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		ЗаполнитьСписокПользователей();
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИнформационнойБазыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Попытка
		ДатаНачала = ТекущаяДата();
		ВыбратьПользователя(ВыбранноеЗначение);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
КонецПроцедуры

&НаСервере
// Получить представление имени пользователя
//
// Параметры:
//  Имя - Строка, имя пользователя информационной базы
//
// Возвращаемое значение:
//  Строка - полное имя пользователя
//
Функция ПредставлениеИмени(Пользователь)
	
	Представление = Пользователь.Имя;
	
	Если Пользователь.АутентификацияОС Тогда
		Представление = Представление + " (" + Пользователь.ПользовательОС + ")";
	КонецЕсли;
	
	Если ТЦСервер.ЕстьРазделители() Тогда
		РазделителиВСтроку = ТЦСервер.РазделителиПользователяИБВСтроку(Пользователь);
	Иначе
		РазделителиВСтроку = "";
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(РазделителиВСтроку) Тогда
		Представление = Представление + "; " + РазделителиВСтроку;
	КонецЕсли;
	
	
	Возврат Представление;
	
КонецФункции // ПредставлениеИмени()

&НаСервере
// Выполнить все, что необходимо при выборе пользователя
//
// Параметры:
//  Пользователь - Структура, описывающая пользователя
//   Имя - Строка, имя пользователя информационной базы
//   Тип - ПеречислениеСсылка.ТЦТипАутентификации
//   ИмяОС - Строка, имя пользователя ОС, если применимо
//
Процедура ВыбратьПользователя(ВыбранныйИдентификаторПользователяИБ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		Новый УникальныйИдентификатор(ВыбранныйИдентификаторПользователяИБ)
	);
	
	Объект.Имя = ПользовательИБ.Имя;
	
	Представление = ПредставлениеИмени(ПользовательИБ);
	Объект.Наименование = Представление;
	
	Если ПользовательИБ.АутентификацияОС Тогда
		Объект.ТипАутентификации = Перечисления.ТЦТипАутентификации.АутентификацияОС;
	ИначеЕсли ПользовательИБ.АутентификацияСтандартная Тогда
		Объект.ТипАутентификации = Перечисления.ТЦТипАутентификации.Аутентификация1С;
	КонецЕсли;
	
	СтруктураРазделителей = ПользовательИБ.РазделениеДанных;
	Объект.Разделители.Очистить();
	Для Каждого СтрокаРазделителя Из СтруктураРазделителей Цикл
		СтрокаРазделителей = Объект.Разделители.Добавить();
		СтрокаРазделителей.Имя = СтрокаРазделителя.Ключ;
		СтрокаРазделителей.Значение = СтрокаРазделителя.Значение;
	КонецЦикла;
	
КонецПроцедуры // ВыбратьПользователя()

&НаСервере
// Заполнить список пользователей
//
Процедура ЗаполнитьСписокПользователей()
	
	Перем Пользователи;
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Если Пользователи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПользователей = Новый ТаблицаЗначений;
	ТипСтрока150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	
	ТаблицаПользователей.Колонки.Добавить("Идентификатор", ТипСтрока150);
	ТаблицаПользователей.Колонки.Добавить("Имя", ТипСтрока150);
	СсылкиНаПользователейИБ = Новый Соответствие;
	
	Для каждого Пользователь Из Пользователи Цикл
		Если Найти(Пользователь.Имя, "_ТЦ") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПользователя = ТаблицаПользователей.Добавить();
		ИдентификаторПользователяИБВСтроку = Строка(Пользователь.УникальныйИдентификатор);
		
		СтрокаПользователя.Идентификатор = ИдентификаторПользователяИБВСтроку;
		СтрокаПользователя.Имя = Пользователь.Имя;
		
		СсылкиНаПользователейИБ.Вставить(
			ИдентификаторПользователяИБВСтроку,
			Пользователь
		);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Пользователи", ТаблицаПользователей);
	Запрос.УстановитьПараметр("ТекущийИдентификаторПользователяИБ", Объект.Ссылка.ИдентификаторПользователяИБ);
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Пользователи.Идентификатор,
		|	Пользователи.Имя
		|ПОМЕСТИТЬ
		|	ВсеПользователи
		|ИЗ
		|	&Пользователи КАК Пользователи
		|;
		|
		|ВЫБРАТЬ
		|	Идентификатор, Имя
		|ИЗ
		|	ВсеПользователи
		|ГДЕ
		|	Идентификатор НЕ В
		|	(
		|		ВЫБРАТЬ
		|			ИдентификаторПользователяИБ
		|		ИЗ
		|			Справочник.ТЦПользователи
		|		ГДЕ
		|			ИдентификаторПользователяИБ <> &ТекущийИдентификаторПользователяИБ
		|	)
		|УПОРЯДОЧИТЬ ПО
		|	Имя";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВыбора = Элементы.ПользовательИнформационнойБазы.СписокВыбора;
	
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторПользователяИБВСтроку = Выборка.Идентификатор;
		
		ПользовательИБ = СсылкиНаПользователейИБ.Получить(ИдентификаторПользователяИБВСтроку);
		Представление = ПредставлениеИмени(ПользовательИБ);
		
		ЭлементВыбора = СписокВыбора.Добавить(
			ИдентификаторПользователяИБВСтроку,
			Представление
		);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСписокПользователей()
